[
  {
    "year": 1977,
    "genre": "Adventure",
    "title": "Star Wars",
    "artist": {
      "DOB": "1944",
      "name": "George",
      "surname": "Lucas",
      "artistId": 1
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 11,
    "summary": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire."
  },
  {
    "year": 1941,
    "genre": "Mystery",
    "title": "Citizen Kane",
    "artist": {
      "DOB": "1915",
      "name": "Orson",
      "surname": "Welles",
      "artistId": 40
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 15,
    "summary": "Newspaper magnate, Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event."
  },
  {
    "year": 2003,
    "genre": "Action",
    "title": "Kill Bill: Vol. 1",
    "artist": {
      "DOB": "1963",
      "name": "Quentin",
      "surname": "Tarantino",
      "artistId": 138
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 24,
    "summary": "An assassin is shot by her ruthless employer, Bill, and other members of their assassination circle – but she lives to plot her vengeance."
  },
  {
    "year": 1992,
    "genre": "Western",
    "title": "Unforgiven",
    "artist": {
      "DOB": "1930",
      "name": "Clint",
      "surname": "Eastwood",
      "artistId": 190
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 33,
    "summary": "William Munny is a retired, once-ruthless killer turned gentle widower and hog farmer. To help support his two motherless children, he accepts one last bounty-hunter mission to find the men who brutalized a prostitute. Joined by his former partner and a cocky greenhorn, he takes on a corrupt sheriff."
  },
  {
    "year": 2004,
    "genre": "Science Fiction",
    "title": "Eternal Sunshine of the Spotless Mind",
    "artist": {
      "DOB": "1963",
      "name": "Michel",
      "surname": "Gondry",
      "artistId": 201
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 38,
    "summary": "Joel Barish, heartbroken that his girlfriend underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realises that he still loves her, and may be too late to correct his mistake."
  },
  {
    "year": 2005,
    "genre": "Drama",
    "title": "A History of Violence",
    "artist": {
      "DOB": "1943",
      "name": "David",
      "surname": "Cronenberg",
      "artistId": 224
    },
    "country": {
      "code": "CA",
      "name": "Canada",
      "language": ""
    },
    "movieId": 59,
    "summary": "An average family is thrust into the spotlight after the father commits a seemingly self-defense murder at his diner."
  },
  {
    "year": 1968,
    "genre": "Science Fiction",
    "title": "2001: A Space Odyssey",
    "artist": {
      "DOB": "1928",
      "name": "Stanley",
      "surname": "Kubrick",
      "artistId": 240
    },
    "country": {
      "code": "GB",
      "name": "United Kingdom",
      "language": "english"
    },
    "movieId": 62,
    "summary": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer."
  },
  {
    "year": 2005,
    "genre": "Adventure",
    "title": "War of the Worlds",
    "artist": {
      "DOB": "1946",
      "name": "Steven",
      "surname": "Spielberg",
      "artistId": 488
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 74,
    "summary": "Ray Ferrier is a divorced dockworker and less-than-perfect father. Soon after his ex-wife and her new husband drop off his teenage son and young daughter for a rare weekend visit, a strange and powerful lightning storm touches down."
  },
  {
    "year": 1996,
    "genre": "Comedy",
    "title": "Mars Attacks!",
    "artist": {
      "DOB": "1958",
      "name": "Tim",
      "surname": "Burton",
      "artistId": 510
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 75,
    "summary": "A fleet of Martian spacecraft surrounds the world's major cities and all of humanity waits to see if the extraterrestrial visitors have, as they claim, \"come in peace.\" U.S. President James Dale receives assurance from science professor Donald Kessler that the Martians' mission is a friendly one. But when a peaceful exchange ends in the total annihilation of the U.S. Congress, military men call for a full-scale nuclear retaliation."
  },
  {
    "year": 2000,
    "genre": "Mystery",
    "title": "Memento",
    "artist": {
      "DOB": "1970",
      "name": "Christopher",
      "surname": "Nolan",
      "artistId": 525
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 77,
    "summary": "Leonard Shelby is tracking down the man who raped and murdered his wife. The difficulty of locating his wife's killer, however, is compounded by the fact that he suffers from a rare, untreatable form of short-term memory loss. Although he can recall details of life before his accident, Leonard cannot remember what happened fifteen minutes ago, where he's going, or why."
  },
  {
    "year": 1982,
    "genre": "Science Fiction",
    "title": "Blade Runner",
    "artist": {
      "DOB": "1937",
      "name": "Ridley",
      "surname": "Scott",
      "artistId": 578
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 78,
    "summary": "In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans."
  },
  {
    "year": 1981,
    "genre": "Adventure",
    "title": "Raiders of the Lost Ark",
    "artist": {
      "DOB": "1946",
      "name": "Steven",
      "surname": "Spielberg",
      "artistId": 488
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 85,
    "summary": "When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime."
  },
  {
    "year": 1984,
    "genre": "Adventure",
    "title": "Indiana Jones and the Temple of Doom",
    "artist": {
      "DOB": "1946",
      "name": "Steven",
      "surname": "Spielberg",
      "artistId": 488
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 87,
    "summary": "After arriving in India, Indiana Jones is asked by a desperate village to find a mystical stone. He agrees – and stumbles upon a secret cult plotting a terrible plan in the catacombs of an ancient palace."
  },
  {
    "year": 1989,
    "genre": "Adventure",
    "title": "Indiana Jones and the Last Crusade",
    "artist": {
      "DOB": "1946",
      "name": "Steven",
      "surname": "Spielberg",
      "artistId": 488
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 89,
    "summary": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!"
  },
  {
    "year": 2000,
    "genre": "Action",
    "title": "Gladiator",
    "artist": {
      "DOB": "1937",
      "name": "Ridley",
      "surname": "Scott",
      "artistId": 578
    },
    "country": {
      "code": "GB",
      "name": "United Kingdom",
      "language": "english"
    },
    "movieId": 98,
    "summary": "In the year 180, the death of emperor Marcus Aurelius throws the Roman Empire into chaos. Maximus is one of the Roman army's most capable and trusted generals and a key advisor to the emperor. As Marcus' devious son Commodus ascends to the throne, Maximus is set to be executed. He escapes, but is captured by slave traders. Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences."
  },
  {
    "year": 1976,
    "genre": "Crime",
    "title": "Taxi Driver",
    "artist": {
      "DOB": "1942",
      "name": "Martin",
      "surname": "Scorsese",
      "artistId": 1032
    },
    "country": {
      "code": "US",
      "name": "USA",
      "language": "english"
    },
    "movieId": 103,
    "summary": "A mentally unstable Vietnam War veteran works as a night-time taxi driver in New York City where the perceived decadence and sleaze feed his urge for violent action."
  },
  {
    "year": 1987,
    "genre": "Science Fiction",
    "title": "Predator",
    "artist": {
      "DOB": "1951",
      "name": "John",
      "surname": "McTiernan",
      "artistId": 1090
    },
    "country": {
      "code": "MX",
      "name": "Mexico",
      "language": ""
    },
    "movieId": 106,
    "summary": "A team of elite commandos on a secret mission in a Central American jungle come to find themselves hunted by an extraterrestrial warrior."
  }
]